Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateElementInView Property
 Can't create this kind of element in this view in the current mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateElementInView { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateElementInView As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateElementInView {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace